# Data analysis exercise with Python

#### Youssef de Madeen Amadou

### Open files “dummy data Jan.ctl” and “dummy data Feb.ctl”

Note: This file type works like a csv, but instead of being separated by commas, it’s seperated by this symbol "|". This is called being pipe delimited. It can be opened with a csv reader, but you'll have to specify this.

### Name the columns. 
The names of the columns are 'END_USER_ID', 'ID', 'START_TIMESTAMP', and 'BROWSER'.

In [282]:
import csv
import numpy as np
import pandas as pd

## Data loading

In [283]:
jan = pd.read_csv('./dummy data Jan.ctl',sep="|",names=['END_USER_ID', 'ID', 'START_TIMESTAMP','BROWSER'])
feb = pd.read_csv('./dummy data Feb.ctl',sep="|",names=['END_USER_ID', 'ID', 'START_TIMESTAMP','BROWSER'])

In [284]:
jan.head()

   END_USER_ID       ID  START_TIMESTAMP BROWSER
0            1   8718.0     1.484357e+09  Chrome
1            2  19089.0     1.484136e+09  Chrome
2            3  41899.0     1.484002e+09  Chrome
3            4  30423.0     1.483849e+09  Chrome
4            5    413.0     1.484135e+09  Chrome

In [22]:
feb.head()

   END_USER_ID       ID  START_TIMESTAMP BROWSER
0         1061   5630.0     1.487566e+09  Chrome
1         2918   9030.0     1.486140e+09  Chrome
2         6724  19311.0     1.487272e+09  Chrome
3          633  14057.0     1.487732e+09  Chrome
4         5837   6825.0     1.487498e+09  Chrome

# Append the January and February files together.

In [324]:
jan_feb = jan.append(feb)
jan_feb.head()

   END_USER_ID       ID  START_TIMESTAMP BROWSER
0            1   8718.0     1.484357e+09  Chrome
1            2  19089.0     1.484136e+09  Chrome
2            3  41899.0     1.484002e+09  Chrome
3            4  30423.0     1.483849e+09  Chrome
4            5    413.0     1.484135e+09  Chrome

# Give me the average value of the “ID” column.

Method 1

In [33]:
jan_feb.pivot_table('ID','BROWSER',aggfunc='mean')

                   ID
BROWSER
Android  25769.034483
Chrome   24761.938017
Firefox  24372.659429
IE       24608.541725
Opera    25265.609375
Safari   25361.102970

Method 2

In [52]:
jan_feb[['ID','BROWSER']].groupby(['BROWSER']).aggregate('mean')

                   ID
BROWSER
Android  25769.034483
Chrome   24761.938017
Firefox  24372.659429
IE       24608.541725
Opera    25265.609375
Safari   25361.102970

#For each browser type, what is the average "ID".

# How many rows have incomplete data?

In [143]:
jan_feb.shape[0] - jan_feb.dropna().shape[0]

29

29 rows with incomplete data

For every row with a Chrome Browser, add 2 to the ID.

In [325]:
jf = jan_feb

In [326]:
jan_feb.ID = jf.ID + 2

In [328]:
jan_feb.head()

   END_USER_ID       ID  START_TIMESTAMP BROWSER
0            1   8720.0     1.484357e+09  Chrome
1            2  19091.0     1.484136e+09  Chrome
2            3  41901.0     1.484002e+09  Chrome
3            4  30425.0     1.483849e+09  Chrome
4            5    415.0     1.484135e+09  Chrome

Save the new dataframe as a csv.

In [329]:
jan_feb.to_csv('./dummy_data_jan_feb.csv',index='false')

##END